import json
import re

with open("temp.json", "rb") as file:
    regions = json.load(file)

temp = """1 Сердюков Трофим Викторович
2 Самойликов Алексей Александрович
3Кучеренко Анжелла Анатольевна
4Кочергина Ирина Николаевна
5 Потапов Игорь Борисович
6 Шиллер Дмитрий Августович
7 Гудз Олег Владимирович
8Гуляй Геннадий Витальевич
9 Толстопятов Игорь Анатольевич
10 Горбунов Андрей Анатольевич
11 Анашкин Дмитрий Валентинович
12 Карпусь Евгений Александрович
13 Ильюшина Анастасия Дмитриевна
14 Скрипунцова Евгения Михайловна
15 Черных Елена Владимировна
16 Дубовик Данила Андреевич
17 Гинько Оксана Геннадьевна
18 Давыденко Андрей Викторович
19 Ермолина Евгения Олеговна
20 Бабич Наталья Андреевна
21 Морозов Тимофей Васильевич
22 Кулик Евгений Викторович
23 Антонова Татьяна Викторовна
24 Глухих Анастасия Владимировна
25 Захаров Игорь Викторович
26 Симакова Ирина Павловна
27 Чугреев Сергей Олегович
28Курманаевский Дмитрий Дмитриевич
29 Гривцова Елена Викторовна
30 Спиридонов Дмитрий Александрович
31 Авдеев Алексей Владимирович
32 Надеждин Захар Алексеевич
33 Быков Валерий Алексеевич
34 Исаков Тарас Мамаджанович
35 Каталова Ольга Андреевна
36 Коробов Владимир Васильевич
37  Сомова Анастасия Андреевна
38 Коробов Владимир Васильевич
39 Дудченко Павел Григорьевич
40 Прохорова Ольга Андреевна
41 Горбунов Игорь Владимирович
42 Аргунов Александр Юрьевич """

presidents = {}
for line in temp.splitlines():
    match = re.fullmatch(r"(\d+)\s*([а-яА-Я]+)\s*([а-яА-Я]+)\s*([а-яА-Я]+)\s*", line)
    id, last_name, first_name, middle_name = match.groups()
    data = dict(last_name=last_name, first_name=first_name, middle_name=middle_name)
    presidents[int(id)] = data

for data in regions:
    presid = presidents[data["id"]]
    last_name = presid["last_name"]
    first_name = presid["first_name"]
    middle_name = presid["middle_name"]

    data["president"] = " ".join(presid.values())

with open("temp.json", "wb+") as file:
    file.write(json.dumps(regions, ensure_ascii=False, indent=4).encode())
